Show / Hide Table of Contents
Class OpeningRectOffsets
Representation of rectangular opening in IDEA StatiCa Detail
Inheritance
System.Object
OpenObject
OpenElementId
Opening
OpeningRectOffsets
Inherited Members
 Opening.Name
 Opening.GeomId
 Opening.MasterComponent
 Opening.MasterPoint
 Opening.InsertPoint
 Opening.Outline
 Opening.Position
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Detail
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass(typeof(Opening))]
public class OpeningRectOffsets : Opening
Constructors
Improve this Doc   View Source
OpeningRectOffsets()
Constructor
Declaration
public OpeningRectOffsets()
Properties
Improve this Doc   View Source
OffsetX1
top left X offset
Declaration
public double OffsetX1 { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
OffsetX2
top right x offset
Declaration
public double OffsetX2 { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
OffsetY1
right bottom y offset
Declaration
public double OffsetY1 { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
OffsetY2
right top y offset
Declaration
public double OffsetY2 { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
X1
Left
Declaration
public double X1 { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
X2
Right
Declaration
public double X2 { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Y1
Bottom
Declaration
public double Y1 { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Y2
Top
Declaration
public double Y2 { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source